---
kind: property
id: P:Autodesk.Revit.DB.WallSweepInfo.IsProfileFlipped
source: html/0455b311-c69b-a53d-004b-8cb8d3f86526.htm
---
# Autodesk.Revit.DB.WallSweepInfo.IsProfileFlipped Property

Indicates if the profile is applied upside-down.

## Syntax (C#)
```csharp
public bool IsProfileFlipped { get; set; }
```